Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡུལ་ཀ་ཤི་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་བཱ་རཱ་ཎ་སཱིར་བྱོན་ནས།
en: Mahāsenā The Buddha, the Blessed One, was once traveling through the country of Kāśi and arrived in Vārāṇasī.

source: བཱ་རཱ་ཎ་སཱི་ན་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་ན་བཞུགས་སོ།
en: He stayed in the Deer Park at Ṛṣivadana near Vārāṇasī.

source: །བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་སྡེ་ཆེན་ཞེས་བྱ་བ་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཞིག་གནས་སོ།
en: A householder named Mahāsena was living in Vārāṇasī. He was rich and had great wealth and many possessions.

source: །དེའི་ཆུང་མ་ནི་སྡེ་ཆེན་མ་ཞེས་བྱའོ།
en: His wife’s name was Mahāsenā.

source: །དེ་ཆུང་མ་དང་བཅས་ཏེ་དད་པ་བཟང་བ་དགེ་བའི་བསམ་པ་ཅན་ཡིན་ཏེ།
en: Both he and his wife were pious and good and had virtuous dispositions.

source: དེས་བཅོམ་ལྡན་འདས་ཡུལ་ཀ་ཤི་ཞེས་བྱ་བ་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་བཱ་རཱ་ཎ་སཱིར་བྱོན་ནས། བཱ་རཱ་ཎ་སཱི་ན་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་ན་བཞུགས་སོ་ཞེས་ཐོས་སོ།
en: Mahāsena heard that the Buddha, the Blessed One, had arrived in Vārāṇasī, having traveled through the country of Kāśi, and that he was staying in the Deer Park at Ṛṣivadana near Vārāṇasī.

source: །ཐོས་ནས་ཀྱང་འདི་སྙམ་དུ་སེམས་ཏེ། བཅོམ་ལྡན་འདས་བདག་གི་ཁྱིམ་དུ་ལན་མང་དུ་སྤྱན་དྲངས་ཏེ་ཞལ་ཟས་ནི་གསོལ་ན་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་མ་བསྟབས་ཀྱིས།
en: When Mahāsena heard that, he thought, “Although the Blessed One has been invited to my house many times and has had meals, he has never been offered all the requisites.

source: མ་ལ་བདག་གིས་ད་བཅོམ་ལྡན་འདས་ལ་ཟླ་བ་གསུམ་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྟབས་པར་བྱའོ་སྙམ་ནས།
en: Now I will offer the Blessed One all the requisites for three months.”

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་སྡེ་ཆེན་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་པར་མཛད། ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་མཛད། ཡང་དག་པར་གཟེངས་སྟོད་པར་མཛད།
en: He went to the Blessed One, and when he arrived, he bowed down until his forehead touched the feet of the Blessed One, and then he sat down to one side. When he had sat down to one side, the Blessed One, through talk consistent with the Dharma, instructed, inspired, encouraged, and delighted the householder Mahāsena.

source: ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་དེ། རྣམ་གྲངས་དུ་མར་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག ། ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་ཅང་མི་གསུང་ངོ་། །དེ་ནས་ཁྱིམ་བདག་སྡེ་ཆེན་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལ་མངོན་པར་བསྟོད་དེ་རྗེས་སུ་ཡི་རངས་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: After he had instructed, inspired, encouraged, and delighted him in a variety of ways through talk consistent with the Dharma, the Blessed One remained silent. Then the householder Mahāsena praised and rejoiced in the words of the Blessed One.

source: །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ལ་དགུང་ཟླ་གསུམ་དུ་ན་བཟའ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་དཔྱད་ཀྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་རྣམས་འབུལ་ན་བདག་ལ་གནང་བར་མཛད་དུ་གསོལ།
en: He rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to him, “May the Blessed One together with the community of monks assent to my offer of the requisites for three months: namely, robes, almsfood, bedding and seats, and medicines for the sick.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་སྡེ་ཆེན་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: The Blessed One assented to the householder Mahāsena by remaining silent.

source: །དེ་ནས་ཁྱིམ་བདག་སྡེ་ཆེན་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དེ་རྗེས་སུ་ཡི་རངས་ནས།
en: The householder Mahāsena again praised and rejoiced in the words of the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ནས་སྟན་ལས་ལངས་ཏེ་སོང་ངོ་།
en: He bowed down until his forehead touched the Blessed One’s feet, then rose from his seat and departed.

source: །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་ཁྱིམ་བདག་སྡེ་ཆེན་གྱིས་ཟླ་བ་གསུམ་དུ་ན་བཟའ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་དཔྱད་ཀྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བསྙེན་བཀུར་ཁོ་ན་བྱས་སོ།
en: The Blessed One together with the community of monks was then provided by the householder Mahāsena with the requisites, namely, robes, almsfood, bedding and seats, and medicines for the sick, for three months.

source: །ཁྱིམ་བདག་སྡེ་ཆེན་གྱི་ཀུན་དུ་སྤྱོད་པ་ནི་ནང་པར་སྔར་ལངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་དགེ་སློང་རྣམས་ལ་ལྟ་བར་བྱེད་པ་ལས་དགེ་སློང་ན་བ་ནད་ཚབས་ཆེ་བ་སྡུག་བསྔལ་བའི་ནད་པ་གཞན་ཞིག་ཡོད་པ་དེ་ལ་སྨན་པས་ཤ་ཁུ་འཐུང་ཤིག་ཅེས་བསྟན་ཏོ།
en: The householder Mahāsena always rose at dawn, bowed down until his forehead touched the Blessed One’s feet, and visited the monks. There was a monk who was ill, seriously ill, afflicted with a painful illness.

source: །དེ་ནས་ཁྱིམ་བདག་སྡེ་ཆེན་དགེ་སློང་དེ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་རྐང་པ་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་དྲིས་པ།
en: The physician told him, “Drink meat broth.” At that time, the householder Mahāsena went to that monk. When Mahāsena arrived, he bowed down until his forehead touched the feet of the monk, and he asked, “Noble one, what did the physician prescribe for you?”

source: འཕགས་པ་སྨན་པས་ཅི་བསྟན། དེས་སྨྲས་པ། ཤ་ཁུ་འཐུང་ཤིག་ལོ།
en: “The physician said to drink meat broth,” replied the sick monk.

source: །དེ་ནས་ཁྱིམ་བདག་སྡེ་ཆེན་རང་གི་ཁྱིམ་དུ་སོང་སྟེ་ཆུང་མ་ལ་སྨྲས་པ། སློབ་དཔོན་ཆེ་གེ་མོ་ཞེས་བྱ་བ་ལ་སྨན་པས་ཤ་ཁུ་འཐུང་ཤིག་ཅེས་བསྟན་གྱིས་སྦྱོར་ལ་སྐུར་ཅིག །དེས་བུ་མོ་ཞིག་ལ་རིན་བསྐུར་ནས་ཚོང་དུས་སུ་བཏང་བ་ལས།
en: Then the householder Mahāsena went to his own house and said to his wife, “Since the physician told Master So-and-so to drink meat broth, prepare it and give it to him.” The householder Mahāsena’s wife handed money to a girl and sent her to the market.

source: དེའི་ཉིན་མོ་རྒྱལ་པོའི་སྲས་བལྟམ་ནས། དེས་དྲིལ་སྒྲོགས་སུ་བཅུག་པ།
en: However, the king’s son was born on that day, and the following prohibition was proclaimed with the ringing of bells:

source: སུས་ཀྱང་སྲོག་གཅད་པར་མི་བྱའོ།
en: “Nobody may kill beings.

source: །གང་ཞིག་སྲོག་བཅད་ན་ཆད་པས་ཆོད་པར་བཅད་དོ་ཞེས་བསྒོའོ། །དེ་ནས་རིན་གྱིས་ཀྱང་ཚོང་དུས་སུ་ཤ་མ་རྙེད་ནས།
en: Whoever kills any living being will be severely punished.” Therefore, the girl could not get meat in the market even with the money.

source: དེ་ནས་བུ་མོ་དེས་དེ་ལྟར་གྱུར་པ་དག་ཁྱིམ་བདག་སྡེ་ཆེན་ལ་རྒྱས་པར་བརྗོད་པ་དང་། ཁྱིམ་བདག་སྡེ་ཆེན་གྱི་ཆུང་མས་བསམས་པ། སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་བདག་ཅག་གི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྟབས་ན། གལ་ཏེ་དགེ་སློང་ཞིག་སྨན་མེད་པས་ཤི་བར་གྱུར་ན་མ་ལེགས་སོ་ཞེས་དེ་སྙམ་དུ་དཔྱད་ནས། གྲི་རྣོན་པོ་བླངས་ཏེ་ཁྱིམ་དུ་ཞུགས་ནས་བརླའི་ཤ་ལས་བཅད་དེ་བུ་མོ་ལ་བྱིན་ནས་བུ་ཤ་འདི་ཁུ་བར་བྱོས་ལ་འཕགས་པ་ཆེ་གེ་མོ་ཞེས་བྱ་བའི་དྲུང་དུ་ཁྱེར་ཅིག །དེས་དེ་ཁྱེར་ནས་དགེ་སློང་གི་ལོངས་སྤྱད་པ་ལས་སོས་པར་གྱུར་ཏོ།། །།འདུལ་བ་གཞི། བམ་པོ་ཉི་ཤུ་གསུམ་པ།
en: When the girl reported this matter in detail to the householder Mahāsena, the householder Mahāsena’s wife thought, “Since we have offered the community of monks headed by the Buddha all the requisites, it would not be good if a monk dies because of a lack of medicine.” She took a sharp knife, entered the house, cut off some flesh from her thigh, handed it to the girl, and said, “Girl, make broth from this flesh and take it to the noble one So-and-so.” The girl took the broth to him, and the monk consumed the broth and recovered his health.

source: དགེ་སློང་དེས་འདི་ལྟར་བདག་ལ་ཁྱིམ་བདག་གི་ཆུང་མ་འདིས་རང་གི་ཤས་བསྙེན་བཀུར་བྱས་པར་རིག་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་དད་པས་བྱིན་པ་ལོངས་སྤྱད་ནས་གློས་ཕབ་སྟེ་འདུག་པ་ནི་རིགས་པ་མ་ཡིན་གྱི།
en: The monk knew that the householder’s wife had served him with her own flesh in that way and thought, “It is not appropriate for me to be lying down after consuming what was given with faith.

source: མ་ལ་བདག་གིས་མ་ཐོབ་པ་ཐོབ་པར་བྱ་བ་དང་། མ་རྟོགས་པ་རྟོགས་པར་བྱ་བ་དང་། མངོན་སུམ་དུ་མ་བྱས་པ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་བརྩོན་པར་བྱའོ་སྙམ་ནས། དེ་བརྩོན་འགྲུས་བརྩམ་པར་བརྩམས་ཏེ།
en: Now I will exert myself in order to attain what I have not attained, realize what I have not realized, and actualize what I have not actualized.” He then became diligent.

source: དེས་བརྩོན་པ་དང་། འབད་པ་དང་། བརྩལ་བ་བྱས་པས་འཁོར་བའི་འཁོར་ལོ་ཆ་ལྔ་པོ་གཡོ་བ་དང་། མི་གཡོ་བ་འདི་ཉིད་རིག་སྟེ།
en: Exerting himself, endeavoring and striving, he came to understand saṃsāra’s ever-revolving five cycles;

source: འདུ་བྱེད་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཉམས་པ་དང་། ལྟུང་བ་དང་། རྣམ་པར་འཐོར་བ་དང་། རྣམ་པར་འཇིག་པའི་ཆོས་ཉིད་དུ་ཟིལ་གྱིས་མནན་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་མངོན་སུམ་དུ་བྱས་ནས་དགྲ་བཅོམ་པར་གྱུར་ཏེ།
en: overthrew all conditioned states by nature subject to degradation, decline, dispersal, and destruction; abandoned all defilements; realized the state of an arhat; and became an arhat.

source: ཁམས་གསུམ་གྱི་འདོད་ཆགས་དང་བྲལ་བ། བོང་བ་དང་གསེར་དུ་མཉམ་པ། ནམ་མཁའ་དང་ལག་མཐིལ་དུ་མཉམ་པའི་སེམས་སྟེའུ་དང་ཙན་དན་དུ་མཉམ་པ།
en: He was free from desire for the three realms—one for whom a lump of dirt was equal to gold, for whom space was equal to the palm of his hand, who accepted being cut by an adze and being anointed with sandal paste as the same, and whose knowledge had shattered the eggshell of ignorance.

source: རིག་པས་མ་རིག་པའི་སྒོ་ངའི་སྦུབས་དྲལ་ཅིང་རིག་པ་དང་། མངོན་པར་ཤེས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ།
en: He attained knowledge, supernormal knowledge, and discerning wisdom;

source: སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་། བཀུར་སྟི་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ།
en: he turned his back on worldly profit, desires, and honors;

source: དབང་པོ་དང་ཉེ་དབང་པོ་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་པར་བྱ་བ་དང་། རྗེད་པར་བྱ་བ་དང་། མངོན་དུ་སྨྲ་བར་བྱ་བར་གྱུར་ཏོ།
en: and he became an object of veneration, respect, and praise for the gods including Indra and Upendra.

source: །སྐབས་དེ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མི་མཁྱེན་པའམ། མི་གཟིགས་པའམ། ཐུགས་སུ་མི་ཆུད་པའམ། རྣམ་པར་མི་མཁྱེན་པ་ཅུང་ཟད་ཀྱང་མི་མངའོ།
en: There is nothing, even in the slightest, that the buddhas, the blessed ones, do not know, see, comprehend, or understand.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོ་ཤམ་ཐབས་མནབས་ལྷུང་བཟེད་དང་། ཆོས་གོས་བསྣམས་ནས་དགེ་སློང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་གྱིས་བལྟས་ཏེ་ཁྱིམ་བདག་སྡེ་ཆེན་གྱི་ཁྱིམ་གང་ན་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ།
en: Early the next morning, the Blessed One dressed, took his bowl and his robe, and, surrounded by a group of monks, went to the house of the householder Mahāsena, followed by the community of monks. When the Blessed One arrived, he sat on the seat prepared for him in front of the community of monks.

source: །བཞུགས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་སྡེ་ཆེན་ལ་བཀའ་སྩལ་པ། ཁྱིམ་བདག་ཁྱིམ་བདག་གི་ཆུང་མ་སྡེ་ཆེན་མ་མི་སྣང་ན་ག་རེ།
en: When he had sat down, the Blessed One said to the householder Mahāsena, “Householder, the householder’s wife Mahāsenā is nowhere to be seen. Where is she?”

source: བཅོམ་ལྡན་འདས་སྤྱོད་ལམ་རྔོ་མི་ཐོག་པས་ཕུགས་ན་མཆིས་སོ།
en: “Blessed One, she is in the innermost apartment because she cannot move.”

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆེ་བའི་བདག་ཉིད་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་ཡིན་པས་བཅོམ་ལྡན་འདས་ཀྱིས་གང་གིས་ན་རྨ་དེ་མདོག་འདྲ་བ་དང་། པགས་པ་འདྲ་བ་དང་། བ་སྤུ་འདྲ་བར་གྱུར་པ་དེ་ལྟར་བྱིན་གྱིས་བརླབས་སོ།
en: The majesty of the buddhas, the blessed ones, is inconceivable. The Blessed One exercised his magical power so that her wound healed and her own color, skin, and hair returned.

source: །དེ་ནས་ཁྱིམ་བདག་སྡེ་ཆེན་གྱི་ཆུང་མ་དད་པ་སྐྱེས་ཏེ་སྒོར་བྱུང་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་སོ།
en: Faith then having arisen in the householder Mahāsena’s wife, she appeared at the door and touched the Blessed One’s feet.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཅི་ཁྱིམ་བདག་གི་ཆུང་མ་འདི་བྱང་ཆུབ་སེམས་དཔའི་སྦུངས་ཉམས་སུ་མྱོང་བར་བྱེད་དམ།
en: The Blessed One asked, “Why has this householder’s wife experienced the power of a bodhisattva?”

source: དེས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: She spoke this verse in reply:

source: བསྒྲིམ་མི་དགོས་པར་འཁོར་བ་ན།
en: “In saṃsāra, with no effort

source: །ལུས་ནི་ཤིན་ཏུ་རྙེད་པར་སླའི།
en: A body is exceedingly easy to attain.

source: །བསྐལ་པ་བྱེ་བ་སྟོང་རྣམས་སུ།
en: But even during ten billion eons,

source: །སྦྱིན་གནས་ཤིན་ཏུ་རྙེད་པར་དཀའ།
en: It is exceedingly difficult to meet a person worthy of gifts.”

source: །དེ་ནས་ཁྱིམ་བདག་སྡེ་ཆེན་གྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བདེ་བར་བཞུགས་པར་རིག་ནས་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་རྣམས་རང་གི་ལག་གིས་སྟོབས་ཤིང་ཚིམ་པར་བྱེད་དོ།
en: The householder Mahāsena then knew that the community of monks headed by the Buddha had sat down in comfort, and with his own hands he served and satisfied them with a pure and fine meal.

source: །རྣམ་གྲངས་དུ་མར་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་རང་གི་ལག་གིས་བསྟབས་ཤིང་ཚིམ་པར་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསོལ་ཟིན་ནས་ཕྱག་བཅབས་ཏེ། ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཆོས་མཉན་པའི་ཕྱིར་འདུག་གོ།
en: When, with his own hands, he had served and satisfied them in a variety of ways with a pure and fine meal, and knowing that the Blessed One had finished his meal and washed his hands and his bowl, the householder took a low seat and sat before the Blessed One in order to hear the Dharma.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་སྡེ་ཆེན་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་པར་མཛད། ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་མཛད། ཡང་དག་པར་གཟེངས་སྟོད་པར་མཛད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་དེ།
en: Then the Blessed One, through talk consistent with the Dharma, instructed, inspired, encouraged, and delighted the householder Mahāsena.

source: རྣམ་གྲངས་དུ་མར་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ།
en: After having instructed, inspired, encouraged, and delighted the householder Mahāsena in a variety of ways through talk consistent with the Dharma, the Blessed One rose from his seat and departed.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་གཙུག་ལག་ཁང་དུ་གཤེགས་ནས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ།
en: Then the Blessed One went to the monastery and sat on the seat prepared for him in front of the community of monks.

source: །བཞུགས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཤ་རྣམས་ཀྱི་ནང་ནས་ནི་འདི་ལྟ་སྟེ། མིའི་ཤ་ཐ་ཆད་ཡིན་ནོ།
en: When he had sat down, the Blessed One said to the monks, “Monks, human flesh is the worst of all kinds of flesh.

source: །དེ་ལྟ་བས་ན་དགེ་སློང་གིས་མིའི་ཤ་བཟའ་བར་མི་བྱའོ།
en: Therefore, monks should not eat human flesh.

source: །དགེ་སློང་གིས་མི་ཤ་ཟོས་ན་ལྟུང་བ་སྦོམ་པོར་འགྱུར་རོ།
en: If a monk eats human flesh, he becomes guilty of a sthūlātyaya offense.

source: །གཞན་ཡང་ངས་དགེ་འདུན་གྱི་གནས་བརྟན་གྱི་དགེ་སློང་གི་ཀུན་ཏུ་སྤྱོད་པའི་ཆོས་བཅའ་བར་བྱ་སྟེ།
en: I will now establish rules of customary behavior for an elder monk of the community.

source: དགེ་འདུན་གྱི་གནས་བརྟན་གྱི་དགེ་སློང་གིས་ཤ་འདྲིམ་པར་བྱེད་ན་འདི་ཅིའི་ཤ་ཞེས་དྲི་བར་བྱའོ། །གལ་ཏེ་དགེ་འདུན་གྱི་གནས་བརྟན་གྱིས་མ་སྤོབས་ན་གནས་བརྟན་གཉིས་པས་དྲི་བར་བྱའོ།
en: If flesh is offered, an elder monk of the community should ask, ‘What flesh is this?’ If the elder monk of the community cannot, the second elder monk should ask.

source: །དགེ་འདུན་གྱི་གནས་བརྟན་གྱིས་ཀུན་དུ་སྤྱད་པའི་ཆོས་ཇི་ལྟར་བཅས་པ་བཞིན་ཡང་དག་པར་བླངས་ཏེ་འཇུག་པར་མི་བྱེད་ན་འགལ་ཚབས་ཅན་དུ་འགྱུར་རོ།
en: If the elder monk of the community does not act in accordance with the established rules of customary behavior, he becomes guilty of an offense.”

source: །དགེ་སློང་ཐམས་ཅད་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་ཁྱིམ་བདག་སྡེ་ཆེན་གྱི་མཆིས་འབྲང་གིས་རང་གི་ཤས་དགེ་སློང་འདི་ལ་བསྙེན་བཀུར་བགྱིས་ལ། དགེ་སློང་འདིས་ཀྱང་སྡེ་ཆེན་མ་ལ་བརྟེན་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་མངོན་སུམ་དུ་བགྱིས་པ་ལ་གཟིགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་ད་ལྟར་འབའ་ཞིག་མ་ཡིན་གྱི།
en: All of the monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “How is it, O Honored One, that the householder Mahāsena’s wife served this monk with her own flesh, and, in dependence upon Mahāsenā, this monk abandoned all the defilements and actualized the state of an arhat?”

source: ཇི་ལྟར་འདིས་འདས་པའི་དུས་ན་ཡང་དགེ་སློང་འདི་ལ་རང་གི་ཤས་བསྙེན་བཀུར་བྱས་ཏེ་འདིས་ཀྱང་དེ་ལ་བརྟེན་ནས་མངོན་པར་ཤེས་པ་ལྔ་མངོན་སུམ་དུ་བྱས་པ་དེ་ཤིན་ཏུ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ།
en: “Listen well, monks,” the Blessed One replied, “and bear in mind how, not only in the present but also in the past, she served this monk with her own flesh, and how this monk actualized the five kinds of supernormal knowledge. I will tell you about it.

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་བཱ་རཱ་ཎ་སཱིའི་གྲོང་ན་ཁྱིམ་བདག་སྡེ་ཆེན་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ། དེའི་ཆུང་མ་སྡེ་ཆེན་མ་ཞེས་བྱའོ།
en: “A long time ago, monks, there was a householder named Mahāsena who lived in Vārāṇasī, and his wife’s name was Mahāsenā.

source: །ཇི་ཙམ་ན་བྲམ་ཟེ་ཚོགས་འདོན་དུ་འཇུག་པ་གཞན་ཞིག་བྲམ་ཟེའི་བུ་ལྔ་བརྒྱ་ཙམ་ལ་བྲམ་ཟེའི་གསང་ཚིག་འདོན་དུ་འཇུག་གོ།
en: At that time, a brahmin schoolteacher was teaching brahmanical mantras to five hundred sons of brahmins.

source: །དེ་ལ་ཁྱིམ་བདག་སྡེ་ཆེན་དད་པ་སྐྱེས་ཏེ། དེས་དེ་འཁོར་དང་བཅས་པ་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྟབས་ཏེ།
en: Faith in the brahmin having arisen in the householder Mahāsena, he offered all the requisites to him and his attendants.

source: ཁྱིམ་བདག་སྡེ་ཆེན་གྱིས་བྲམ་ཟེ་དེ་འཁོར་དང་བཅས་པ་ལ་བཀུར་སྟི་ཁོ་ན་བྱས་སོ།
en: The householder Mahāsena honored the brahmin and his attendants.

source: །ཁྱིམ་བདག་དེའི་ཀུན་ཏུ་སྤྱོད་པ་ནི་ནང་པར་སྔར་ལངས་ཏེ་ནད་པ་རྣམས་ལ་ལྟ་བར་བྱེད་པས་ཇི་ཙམ་ན་བྲམ་ཟེའི་ཁྱེའུ་གཞན་ཞིག་ན་བ་སྡུག་བསྔལ་བ་ནད་ཚབས་ཆེ་བར་གྱུར་ནས་དེ་ལ་སྨན་པས་ཤ་ཁུ་འཐུང་ཤིག་ཅེས་བསྟན་ཏོ།
en: “The householder always used to rise at dawn and look after the sick. A young brahmin then became seriously ill, afflicted with a painful illness.

source: །དེ་ནས་ཁྱིམ་བདག་སྡེ་ཆེན་བྲམ་ཟེའི་ཁྱེའུ་གང་ན་བ་དེར་སོང་སྟེ་སོན་ནས་ཕྱག་བྱས་ཏེ་དྲིས་པ།
en: The physician told him, ‘Drink meat broth.’ Then the householder Mahāsena went to the young brahmin.

source: བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་ལ་སྨན་པས་ཅི་བསྟན།
en: When he arrived, he bowed and asked, ‘Young brahmin, what did the physician prescribe for you?’

source: དེས་སྨྲས་པ། ཤ་ཁུ་འཐུང་ཤིག་ལོ།
en: “ ‘The physician told me to drink meat broth,’ the young brahmin replied.

source: །དེ་ནས་ཁྱིམ་བདག་སྡེ་ཆེན་ཁྱིམ་དག་ཏུ་སོང་ནས་ཆུང་མ་ལ་སྨྲས་པ། བྲམ་ཟེའི་ཁྱེའུ་ཆེ་གེ་མོ་ཞེས་བྱ་བ་ལ་ཤ་ཁུ་འཐུང་ཤིག་ཅེས་སྨན་པས་བསྟན་གྱིས་དེ་སྦྱོར་ལ་སྐུར་ཅིག །དེས་བུ་མོ་ཞིག་ལ་རིན་བསྐུར་ཏེ་ཚོང་དུས་སུ་བཏང་ངོ་།
en: “Then the householder Mahāsena went to his own house and said to his wife, ‘Since the physician told the young brahmin So-and-so to drink meat broth, prepare it and give it to him.’ “The householder Mahāsena’s wife handed money to a girl and sent her to the market.

source: །དེ་ཉིད་ཀྱི་ཉིན་མོ་རྒྱལ་པོའི་བུ་བཙས་ནས་དེས་དྲིལ་སྒྲོགས་སུ་བཅུག་སྟེ།
en: However, the king’s son was born on that day, and the following prohibition was proclaimed with the ringing of bells:

source: །གང་གིས་སྲོག་བཅད་པར་གྱུར་ན་དེ་ཆད་པས་ཆོད་པར་བཅད་དོ་ཞེས་བསྒོའོ། །དེ་ནས་ཚོང་དུས་སུ་རིན་གྱིས་ཀྱང་ཤ་མ་རྙེད་དོ།
en: Whoever kills any being will be severely punished.’ Therefore, the girl could not get meat in the market even with the money.

source: །དེ་ནས་བུ་མོ་དེས་དེ་ལྟར་གྱུར་པ་དག་ཁྱིམ་བདག་སྡེ་ཆེན་གྱི་ཆུང་མ་ལ་རྒྱས་པར་སྨྲས་པ་དང་། ཁྱིམ་བདག་སྡེ་ཆེན་གྱི་ཆུང་མས་བསམས་པ། བྲམ་ཟེ་འཁོར་དང་བཅས་པ་འདི་དག་བདག་ཅག་གིས་ཡོ་བྱད་ཐམས་ཅད་བསྟབས་ན། གལ་ཏེ་བྲམ་ཟེའི་ཁྱེའུ་ཞིག་སྨན་མེད་པས་དུས་བྱས་པར་གྱུར་ན་མ་ལེགས་སོ་ཞེས་དེ་སྙམ་དུ་དཔྱད་ན། གྲི་རྣོན་པོ་བླངས་ཏེ་ཁྱིམ་གྱི་ནང་དུ་ཞུགས་ནས་བརླའི་ཤ་ལས་བཅད་དེ་བུ་མོ་ལ་བྱིན་ནས།
en: “When the girl reported this matter in detail to the householder Mahāsena’s wife, the householder Mahāsena’s wife thought, ‘Since we have offered this brahmin and his attendants all the requisites, it would not be good if a young brahmin dies because of a lack of medicine.’ She took a sharp knife, entered the house, cut off some flesh from her thigh, handed it to the girl, and said, ‘Girl, make broth from this flesh and take it to the young brahmin So-and-so.’

source: བུ་ཤ་འདི་ཁུ་བར་བྱོས་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཆེ་གེ་མོ་ཞེས་བྱ་བའི་དྲུང་དུ་ཁྱེར་ཅིག །དེས་ཁྱེར་ནས་བྲམ་ཟེའི་ཁྱེའུ་དེས་ལོངས་སྤྱད་ནས་སོས་པར་གྱུར་ཏོ།
en: “The girl took it to him and the young brahmin consumed it and recovered his health.

source: །བྲམ་ཟེའི་ཁྱེའུ་དེས་འདི་ལྟར་བདག་ལ་ཁྱིམ་བདག་གི་ཆུང་མ་དེས་རང་གི་ཤས་བསྙེན་བཀུར་བྱས་པར་རིག་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་དད་པས་བྱིན་པ་ཡོངས་སུ་ལོངས་སྤྱད་ནས་བདག་གློས་ཕབ་སྟེ་འདུག་པ་ནི་རིགས་པ་མ་ཡིན་གྱིས།
en: The young brahmin knew that the householder’s wife had served him with her own flesh in that way and thought, ‘It is not appropriate for me to be lying down after consuming what was given with faith.

source: མ་ལ་བདག་གིས་མ་ཐོབ་པ་ཐོབ་པར་བྱ་བ་དང་། མ་རྟོགས་པ་རྟོགས་པར་བྱ་བ་དང་། མངོན་སུམ་དུ་མ་བྱས་པ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་བདག་གིས་འབད་པར་བྱའོ་སྙམ་ནས། དེ་ནས་དེ་ཞི་བའི་ཕྱོགས་སུ་སོང་སྟེ་མངོན་པར་ཤེས་པ་ལྔ་མངོན་སུམ་དུ་བྱས་སོ།
en: Now I will endeavor to attain what I have not attained, realize what I have not realized, and actualize what I have not actualized.’ He then went to a quiet place and actualized the five kinds of supernormal knowledge.

source: །དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས།
en: “What do you think, monks?

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་ཁྱིམ་བདག་སྡེ་ཆེན་ཞེས་བྱ་བའི་ཆུང་མ་གང་ཡིན་པ་དེ་ནི་ཁྱིམ་བདག་སྡེ་ཆེན་གྱི་ཆུང་མ་འདི་ཉིད་ཡིན་ནོ།
en: The one who was the householder Mahāsena’s wife at that time, on that occasion, was indeed this householder Mahāsena’s wife.

source: །དེའི་ཚེ་དེའི་དུས་ཀྱི་བྲམ་ཟེའི་ཁྱེའུ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་འདི་ཉིད་ཡིན་ཏེ་དེའི་ཚེ་ཡང་འདིས་དགེ་སློང་དེ་ལ་རང་གི་ཤས་བསྙེན་བཀུར་བྱས་ཏེ།
en: The one who was the young brahmin at that time, on that occasion, was indeed this monk.

source: འདིས་ཀྱང་དེ་ལ་བརྟེན་ནས་མངོན་པར་ཤེས་པ་ལྔ་མངོན་སུམ་དུ་བྱས་སོ།
en: She then served this monk with her own flesh and he, in dependence upon her, actualized the five kinds of supernormal knowledge.

source: །ད་ལྟར་ཡང་འདིས་དགེ་སློང་འདི་ལ་རང་གི་ཤས་བསྙེན་བཀུར་བྱས་སོ། །དགེ་སློང་འདིས་ཀྱང་འདི་ལ་བརྟེན་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་མངོན་སུམ་དུ་བྱས་སོ།
en: Now, too, she served this monk with her own flesh, and this monk, in dependence upon her, abandoned all defilements and actualized the state of an arhat.

source: །དགེ་སློང་དག་དེ་ལྟ་བས་ན་ལས་གཅིག་ཏུ་གནག་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་གཅིག་ཏུ་གནག་པ་ཡིན།
en: “Therefore, monks, the maturation of entirely negative actions is entirely negative;

source: ལས་གཅིག་ཏུ་དཀར་བ་རྣམས་ཀྱི་ནི་གཅིག་ཏུ་དཀར་བ་ཡིན།
en: the maturation of entirely positive actions is entirely positive;

source: །འདྲེན་མ་རྣམས་ཀྱི་ནི་འདྲེན་མ་ཡིན་ནོ།
en: the maturation of those that are mixed is mixed.

source: །དགེ་སློང་དག་དེ་ལྟ་བས་ན་ད་ཕྱིན་ཆད་ལས་གཅིག་ཏུ་གནག་པ་རྣམས་དང་འདྲེན་མ་ནི་སྤངས་ལ། ལས་གཅིག་ཏུ་དཀར་བ་ལ་བརྩལ་བར་བྱ་སྟེ།
en: Therefore, monks, henceforth you should abandon entirely negative and mixed actions, and you should seek entirely positive actions.

source: དགེ་སློང་དག་ཁྱེད་ཀྱིས་དེ་ལྟ་བུ་ལ་བསླབ་པར་བྱའོ།
en: Monks, that is how you must train.” II. Flesh A. Elephant Flesh

source: །དེའི་ཚེ་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་གླང་པོ་ཆེ་ཚོ་དགུ་ཁ་དག་གོ།
en: At a certain time all the elephants of King Prasenajit of Kosala had died.

source: །མུ་གེའི་དུས་བྱུང་བས་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་རྣམས་ཀྱིས་གླང་པོ་ཆེའི་ཤ་བཟའ་བར་བརྩམས་སོ།
en: Since a famine had broken out, brahmins and householders started to eat elephant flesh.

source: །དྲུག་སྡེའི་དགེ་སློང་དག་སྔ་དྲོ་ཤམ་ཐབས་བགོས་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ནས་མཉན་ཡོད་དུ་བསོད་སྙོམས་ལ་ཞུགས་སོ།
en: Early in the morning, the group of six monks dressed, took their bowls and their robes, and entered Śrāvastī for alms.

source: །ཇི་ཙམ་ན་ཁྱིམ་བདག་གཞན་ཞིག་གིས་གླང་པོ་ཆེའི་ཤ་ཕྲུ་བར་བཅུག་སྟེ་འཚེད་ཅིང་འདུག་པས་ཁྱིམ་དེར་དེ་དག་ཞུགས་པ་དང་། །ཁྱིམ་བདག་གི་ཆུང་མས་སྨྲས་པ། འཕགས་པ་དབུལ་དུ་ཅུང་ཟད་ཀྱང་མ་མཆིས་ཀྱིས་བཞུད་ཅིག །དེ་དག་གིས་སྨྲས་པ།
en: When they entered a house where a householder was cooking elephant flesh in a pot, the householder’s wife said, “Noble ones, we have nothing to offer you. Please leave.”

source: ཕྲུ་བ་འདིའི་ནང་ན་འཚེད་ཅིང་འདུག་ན།
en: “Is there something cooking in this pot?” asked the monks.
